[
  {
    "publisher": "Cold Spring Harbor Laboratory",
    "abstract": "<jats:title>ABSTRACT</jats:title><jats:sec><jats:title>Background</jats:title><jats:p>Long-read shotgun metagenomic sequencing is gaining in popularity and offers many advantages over short-read sequencing. The higher information content in long reads is useful for a variety of metagenomics analyses, including taxonomic classification and profiling. The development of long-read specific tools for taxonomic classification is accelerating, yet there is a lack of information regarding their relative performance. Here, we perform a critical benchmarking study using 11 methods, including five methods designed specifically for long reads. We applied these tools to several mock community datasets generated using Pacific Biosciences (PacBio) HiFi or Oxford Nanopore Technology (ONT) sequencing, and evaluated their performance based on read utilization, detection metrics, and relative abundance estimates.</jats:p></jats:sec><jats:sec><jats:title>Results</jats:title><jats:p>Our results show that long-read classifiers generally performed best. Several short-read classification and profiling methods produced many false positives (particularly at lower abundances), required heavy filtering to achieve acceptable precision (at the cost of reduced recall), and produced inaccurate abundance estimates. By contrast, two long-read methods (BugSeq, MEGAN-LR &amp; DIAMOND) and one generalized method (sourmash) displayed high precision and recall without any filtering required. Furthermore, in the PacBio HiFi datasets these methods detected all species down to the 0.1% abundance level with high precision. Some long-read methods, such as MetaMaps and MMseqs2, required moderate filtering to reduce false positives to resemble the precision and recall of the top-performing methods. We found read quality affected performance for methods relying on protein prediction or exact k-mer matching, and these methods performed better with PacBio HiFi datasets. We also found that long-read datasets with a large proportion of shorter reads (&lt;2kb length) resulted in lower precision and worse abundance estimates, relative to length-filtered datasets. Finally, for classification methods, we found that the long-read datasets produced significantly better results than short-read datasets, demonstrating clear advantages for long-read metagenomic sequencing.</jats:p></jats:sec><jats:sec><jats:title>Conclusions</jats:title><jats:p>Our critical assessment of available methods provides best-practice recommendations for current research using long reads and establishes a baseline for future benchmarking studies.</jats:p></jats:sec>",
    "DOI": "10.1101/2022.01.31.478527",
    "type": "manuscript",
    "source": "Crossref",
    "title": "Evaluation of taxonomic classification and profiling methods for long-read shotgun metagenomic sequencing datasets",
    "author": [
      {
        "given": "Daniel M.",
        "family": "Portik"
      },
      {
        "given": "C. Titus",
        "family": "Brown"
      },
      {
        "given": "N. Tessa",
        "family": "Pierce-Ward"
      }
    ],
    "issued": {
      "date-parts": [
        [
          2022,
          2,
          2
        ]
      ]
    },
    "URL": "https://doi.org/hhqs",
    "id": "z9iHAA1E",
    "note": "This CSL Item was generated by Manubot v0.5.3 from its persistent identifier (standard_id).\nstandard_id: doi:10.1101/2022.01.31.478527"
  },
  {
    "publisher": "Springer Science and Business Media LLC",
    "issue": "1",
    "DOI": "10.1186/s13059-018-1554-6",
    "type": "article-journal",
    "source": "Crossref",
    "title": "RefSeq database growth influences the accuracy of k-mer-based lowest common ancestor species identification",
    "volume": "19",
    "author": [
      {
        "given": "Daniel J.",
        "family": "Nasko"
      },
      {
        "given": "Sergey",
        "family": "Koren"
      },
      {
        "given": "Adam M.",
        "family": "Phillippy"
      },
      {
        "given": "Todd J.",
        "family": "Treangen"
      }
    ],
    "container-title": "Genome Biology",
    "language": "en",
    "issued": {
      "date-parts": [
        [
          2018,
          10,
          30
        ]
      ]
    },
    "URL": "https://doi.org/ggc9db",
    "container-title-short": "Genome Biol",
    "PMCID": "PMC6206640",
    "PMID": "30373669",
    "id": "j7nehrZT",
    "note": "This CSL Item was generated by Manubot v0.5.3 from its persistent identifier (standard_id).\nstandard_id: doi:10.1186/s13059-018-1554-6"
  }
]
